# EmployeeDept

Source: https://www.glassdoor.com/Interview/SQL-questions-A-table-schema-with-tables-like-employee-department-employee-to-projects-projects-1-Select-empl-QTN_1536586.htm

The following questions use the `employees` & `products` tables as given below.

In [2]:
%run Question.ipynb

 * postgresql://fknight:***@localhost/postgres
Done.
Done.
6 rows affected.
6 rows affected.
 * postgresql://fknight:***@localhost/postgres
Done.
Done.
3 rows affected.
Done.
Done.
4 rows affected.

# Part A

Select employee from departments where max salary of the department is 40k

## Example answer

In [3]:
%%sql

SELECT * FROM employees
WHERE dept_id IN (
    SELECT
        dept_id
    FROM employees
    GROUP BY dept_id
    HAVING max(salary) <= 40000
)

 * postgresql://fknight:***@localhost/postgres
2 rows affected.

[(1, 'John', 20000, 1), (2, 'Ava', 10000, 5)]

# Part B

Select all employee who are assigned to projects.

## Example answer

In [4]:
%%sql

SELECT 
    * 
FROM employees 
WHERE id IN (
    SELECT
        DISTINCT employee_id 
    FROM employee_to_projects 
)

 * postgresql://fknight:***@localhost/postgres
4 rows affected.

[(1, 'John', 20000, 1),
 (2, 'Ava', 10000, 5),
 (4, 'Mike', 20000, 2),
 (5, 'Ian', 80000, 2)]

# Part C

Select all employees which have the max salary in a given department.

## Example answer

In [8]:
%%sql

WITH max_salaries AS (
    SELECT 
        dept_id,
        max(salary) AS max_salary
    FROM employees
    GROUP BY dept_id
)

SELECT
    id, name, salary, e.dept_id
FROM employees e
JOIN max_salaries s
ON e.dept_id = s.dept_id
AND e.salary = s.max_salary

 * postgresql://fknight:***@localhost/postgres
4 rows affected.

[(1, 'John', 20000, 1),
 (2, 'Ava', 10000, 5),
 (5, 'Ian', 80000, 2),
 (6, 'John', 50000, 3)]

# Part D

Select the employee with second highest salary.

## Example answer

In [6]:
%%sql

WITH salary_rank AS (
    SELECT
        *,
        row_number() OVER (ORDER BY salary DESC) as row_no
    FROM employees
    ORDER BY salary DESC
)

SELECT
    *
FROM salary_rank
WHERE row_no = 2

 * postgresql://fknight:***@localhost/postgres
1 rows affected.

[(6, 'John', 50000, 3, 2)]